In [17]:
dictt={"familymembers":["mazeed","zahurunnisa","safiya"],"relation":["father","mother","daughter"]}
dictt

{'familymembers': ['mazeed', 'zahurunnisa', 'safiya'],
 'relation': ['father', 'mother', 'daughter']}

In [14]:
import pandas as pd
df1=pd.DataFrame(dictt)
df1

  familymembers  relation
0        mazeed    father
1   zahurunnisa    mother
2        safiya  daughter

In [20]:
dictt1={"familymembers":["mazeed","",""],"relation":["father","mother","daughter"]}
dictt1

{'familymembers': ['mazeed', '', ''],
 'relation': ['father', 'mother', 'daughter']}

In [22]:
import pandas as pd
df2=pd.DataFrame(dictt1)
df2

  familymembers  relation
0        mazeed    father
1                  mother
2                daughter

In [23]:
pd.concat([df1,df2],axis=1)

  familymembers  relation familymembers  relation
0        mazeed    father        mazeed    father
1   zahurunnisa    mother                  mother
2        safiya  daughter                daughter

In [24]:
pd.concat([df1,df2],axis=0)

  familymembers  relation
0        mazeed    father
1   zahurunnisa    mother
2        safiya  daughter
0        mazeed    father
1                  mother
2                daughter

In [26]:
pd.concat([df1,df2],ignore_index="True",axis=0)

  familymembers  relation
0        mazeed    father
1   zahurunnisa    mother
2        safiya  daughter
3        mazeed    father
4                  mother
5                daughter

In [28]:
pd.concat([df1,df2],ignore_index="True",axis=1)

             0         1       2         3
0       mazeed    father  mazeed    father
1  zahurunnisa    mother            mother
2       safiya  daughter          daughter